fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_pwm.h
//*****************************************************************************
//
// hw_pwm.h - Defines and Macros for Pulse Width Modulation (PWM) ports.
//
// Copyright (c) 2005-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __HW_PWM_H__
#define __HW_PWM_H__

//*****************************************************************************
//
// The following are defines for the PWM register offsets.
//
//*****************************************************************************
#define PWM_O_CTL      0x00000000    // PWM Master Control
#define PWM_O_SYNC     0x00000004    // PWM Time Base Sync
#define PWM_O_ENABLE   0x00000008    // PWM Output Enable
#define PWM_O_INVERT   0x0000000C    // PWM Output Inversion
#define PWM_O_FAULT    0x00000010    // PWM Output Fault
#define PWM_O_INTEN    0x00000014    // PWM Interrupt Enable
#define PWM_O_RIS      0x00000018    // PWM Raw Interrupt Status
#define PWM_O_ISC      0x0000001C    // PWM Interrupt Status and Clear
#define PWM_O_STATUS   0x00000020    // PWM Status
#define PWM_O_FAULTVAL 0x00000024    // PWM Fault Condition Value
#define PWM_O_ENUPD    0x00000028    // PWM Enable Update
#define PWM_O_0_CTL    0x00000040    // PWM0 Control
#define PWM_O_0_INTEN \
    0x00000044                       // PWM0 Interrupt and Trigger
                                     // Enable
#define PWM_O_0_RIS    0x00000048    // PWM0 Raw Interrupt Status
#define PWM_O_0_ISC    0x0000004C    // PWM0 Interrupt Status and Clear
#define PWM_O_0_LOAD   0x00000050    // PWM0 Load
#define PWM_O_0_COUNT  0x00000054    // PWM0 Counter
#define PWM_O_0_CMPA   0x00000058    // PWM0 Compare A
#define PWM_O_0_CMPB   0x0000005C    // PWM0 Compare B
#define PWM_O_0_GENA   0x00000060    // PWM0 Generator A Control
#define PWM_O_0_GENB   0x00000064    // PWM0 Generator B Control
#define PWM_O_0_DBCTL  0x00000068    // PWM0 Dead-Band Control
#define PWM_O_0_DBRISE 0x0000006C    // PWM0 Dead-Band Rising-Edge Delay
#define PWM_O_0_DBFALL \
    0x00000070                       // PWM0 Dead-Band
                                     // Falling-Edge-Delay
#define PWM_O_0_FLTSRC0   0x00000074 // PWM0 Fault Source 0
#define PWM_O_0_FLTSRC1   0x00000078 // PWM0 Fault Source 1
#define PWM_O_0_MINFLTPER 0x0000007C // PWM0 Minimum Fault Period
#define PWM_O_1_CTL       0x00000080 // PWM1 Control
#define PWM_O_1_INTEN \
    0x00000084                       // PWM1 Interrupt and Trigger
                                     // Enable
#define PWM_O_1_RIS    0x00000088    // PWM1 Raw Interrupt Status
#define PWM_O_1_ISC    0x0000008C    // PWM1 Interrupt Status and Clear
#define PWM_O_1_LOAD   0x00000090    // PWM1 Load
#define PWM_O_1_COUNT  0x00000094    // PWM1 Counter
#define PWM_O_1_CMPA   0x00000098    // PWM1 Compare A
#define PWM_O_1_CMPB   0x0000009C    // PWM1 Compare B
#define PWM_O_1_GENA   0x000000A0    // PWM1 Generator A Control
#define PWM_O_1_GENB   0x000000A4    // PWM1 Generator B Control
#define PWM_O_1_DBCTL  0x000000A8    // PWM1 Dead-Band Control
#define PWM_O_1_DBRISE 0x000000AC    // PWM1 Dead-Band Rising-Edge Delay
#define PWM_O_1_DBFALL \
    0x000000B0                       // PWM1 Dead-Band
                                     // Falling-Edge-Delay
#define PWM_O_1_FLTSRC0   0x000000B4 // PWM1 Fault Source 0
#define PWM_O_1_FLTSRC1   0x000000B8 // PWM1 Fault Source 1
#define PWM_O_1_MINFLTPER 0x000000BC // PWM1 Minimum Fault Period
#define PWM_O_2_CTL       0x000000C0 // PWM2 Control
#define PWM_O_2_INTEN \
    0x000000C4                       // PWM2 Interrupt and Trigger
                                     // Enable
#define PWM_O_2_RIS    0x000000C8    // PWM2 Raw Interrupt Status
#define PWM_O_2_ISC    0x000000CC    // PWM2 Interrupt Status and Clear
#define PWM_O_2_LOAD   0x000000D0    // PWM2 Load
#define PWM_O_2_COUNT  0x000000D4    // PWM2 Counter
#define PWM_O_2_CMPA   0x000000D8    // PWM2 Compare A
#define PWM_O_2_CMPB   0x000000DC    // PWM2 Compare B
#define PWM_O_2_GENA   0x000000E0    // PWM2 Generator A Control
#define PWM_O_2_GENB   0x000000E4    // PWM2 Generator B Control
#define PWM_O_2_DBCTL  0x000000E8    // PWM2 Dead-Band Control
#define PWM_O_2_DBRISE 0x000000EC    // PWM2 Dead-Band Rising-Edge Delay
#define PWM_O_2_DBFALL \
    0x000000F0                       // PWM2 Dead-Band
                                     // Falling-Edge-Delay
#define PWM_O_2_FLTSRC0   0x000000F4 // PWM2 Fault Source 0
#define PWM_O_2_FLTSRC1   0x000000F8 // PWM2 Fault Source 1
#define PWM_O_2_MINFLTPER 0x000000FC // PWM2 Minimum Fault Period
#define PWM_O_3_CTL       0x00000100 // PWM3 Control
#define PWM_O_3_INTEN \
    0x00000104                       // PWM3 Interrupt and Trigger
                                     // Enable
#define PWM_O_3_RIS    0x00000108    // PWM3 Raw Interrupt Status
#define PWM_O_3_ISC    0x0000010C    // PWM3 Interrupt Status and Clear
#define PWM_O_3_LOAD   0x00000110    // PWM3 Load
#define PWM_O_3_COUNT  0x00000114    // PWM3 Counter
#define PWM_O_3_CMPA   0x00000118    // PWM3 Compare A
#define PWM_O_3_CMPB   0x0000011C    // PWM3 Compare B
#define PWM_O_3_GENA   0x00000120    // PWM3 Generator A Control
#define PWM_O_3_GENB   0x00000124    // PWM3 Generator B Control
#define PWM_O_3_DBCTL  0x00000128    // PWM3 Dead-Band Control
#define PWM_O_3_DBRISE 0x0000012C    // PWM3 Dead-Band Rising-Edge Delay
#define PWM_O_3_DBFALL \
    0x00000130                       // PWM3 Dead-Band
                                     // Falling-Edge-Delay
#define PWM_O_3_FLTSRC0   0x00000134 // PWM3 Fault Source 0
#define PWM_O_3_FLTSRC1   0x00000138 // PWM3 Fault Source 1
#define PWM_O_3_MINFLTPER 0x0000013C // PWM3 Minimum Fault Period
#define PWM_O_0_FLTSEN    0x00000800 // PWM0 Fault Pin Logic Sense
#define PWM_O_0_FLTSTAT0  0x00000804 // PWM0 Fault Status 0
#define PWM_O_0_FLTSTAT1  0x00000808 // PWM0 Fault Status 1
#define PWM_O_1_FLTSEN    0x00000880 // PWM1 Fault Pin Logic Sense
#define PWM_O_1_FLTSTAT0  0x00000884 // PWM1 Fault Status 0
#define PWM_O_1_FLTSTAT1  0x00000888 // PWM1 Fault Status 1
#define PWM_O_2_FLTSEN    0x00000900 // PWM2 Fault Pin Logic Sense
#define PWM_O_2_FLTSTAT0  0x00000904 // PWM2 Fault Status 0
#define PWM_O_2_FLTSTAT1  0x00000908 // PWM2 Fault Status 1
#define PWM_O_3_FLTSEN    0x00000980 // PWM3 Fault Pin Logic Sense
#define PWM_O_3_FLTSTAT0  0x00000984 // PWM3 Fault Status 0
#define PWM_O_3_FLTSTAT1  0x00000988 // PWM3 Fault Status 1
#define PWM_O_PP          0x00000FC0 // PWM Peripheral Properties
#define PWM_O_CC          0x00000FC8 // PWM Clock Configuration

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_CTL register.
//
//*****************************************************************************
#define PWM_CTL_GLOBALSYNC3 0x00000008 // Update PWM Generator 3
#define PWM_CTL_GLOBALSYNC2 0x00000004 // Update PWM Generator 2
#define PWM_CTL_GLOBALSYNC1 0x00000002 // Update PWM Generator 1
#define PWM_CTL_GLOBALSYNC0 0x00000001 // Update PWM Generator 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_SYNC register.
//
//*****************************************************************************
#define PWM_SYNC_SYNC3 0x00000008 // Reset Generator 3 Counter
#define PWM_SYNC_SYNC2 0x00000004 // Reset Generator 2 Counter
#define PWM_SYNC_SYNC1 0x00000002 // Reset Generator 1 Counter
#define PWM_SYNC_SYNC0 0x00000001 // Reset Generator 0 Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_ENABLE register.
//
//*****************************************************************************
#define PWM_ENABLE_PWM7EN 0x00000080 // MnPWM7 Output Enable
#define PWM_ENABLE_PWM6EN 0x00000040 // MnPWM6 Output Enable
#define PWM_ENABLE_PWM5EN 0x00000020 // MnPWM5 Output Enable
#define PWM_ENABLE_PWM4EN 0x00000010 // MnPWM4 Output Enable
#define PWM_ENABLE_PWM3EN 0x00000008 // MnPWM3 Output Enable
#define PWM_ENABLE_PWM2EN 0x00000004 // MnPWM2 Output Enable
#define PWM_ENABLE_PWM1EN 0x00000002 // MnPWM1 Output Enable
#define PWM_ENABLE_PWM0EN 0x00000001 // MnPWM0 Output Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_INVERT register.
//
//*****************************************************************************
#define PWM_INVERT_PWM7INV 0x00000080 // Invert MnPWM7 Signal
#define PWM_INVERT_PWM6INV 0x00000040 // Invert MnPWM6 Signal
#define PWM_INVERT_PWM5INV 0x00000020 // Invert MnPWM5 Signal
#define PWM_INVERT_PWM4INV 0x00000010 // Invert MnPWM4 Signal
#define PWM_INVERT_PWM3INV 0x00000008 // Invert MnPWM3 Signal
#define PWM_INVERT_PWM2INV 0x00000004 // Invert MnPWM2 Signal
#define PWM_INVERT_PWM1INV 0x00000002 // Invert MnPWM1 Signal
#define PWM_INVERT_PWM0INV 0x00000001 // Invert MnPWM0 Signal

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_FAULT register.
//
//*****************************************************************************
#define PWM_FAULT_FAULT7 0x00000080 // MnPWM7 Fault
#define PWM_FAULT_FAULT6 0x00000040 // MnPWM6 Fault
#define PWM_FAULT_FAULT5 0x00000020 // MnPWM5 Fault
#define PWM_FAULT_FAULT4 0x00000010 // MnPWM4 Fault
#define PWM_FAULT_FAULT3 0x00000008 // MnPWM3 Fault
#define PWM_FAULT_FAULT2 0x00000004 // MnPWM2 Fault
#define PWM_FAULT_FAULT1 0x00000002 // MnPWM1 Fault
#define PWM_FAULT_FAULT0 0x00000001 // MnPWM0 Fault

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_INTEN register.
//
//*****************************************************************************
#define PWM_INTEN_INTFAULT3 0x00080000 // Interrupt Fault 3
#define PWM_INTEN_INTFAULT2 0x00040000 // Interrupt Fault 2
#define PWM_INTEN_INTFAULT1 0x00020000 // Interrupt Fault 1
#define PWM_INTEN_INTFAULT0 0x00010000 // Interrupt Fault 0
#define PWM_INTEN_INTPWM3   0x00000008 // PWM3 Interrupt Enable
#define PWM_INTEN_INTPWM2   0x00000004 // PWM2 Interrupt Enable
#define PWM_INTEN_INTPWM1   0x00000002 // PWM1 Interrupt Enable
#define PWM_INTEN_INTPWM0   0x00000001 // PWM0 Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_RIS register.
//
//*****************************************************************************
#define PWM_RIS_INTFAULT3 0x00080000 // Interrupt Fault PWM 3
#define PWM_RIS_INTFAULT2 0x00040000 // Interrupt Fault PWM 2
#define PWM_RIS_INTFAULT1 0x00020000 // Interrupt Fault PWM 1
#define PWM_RIS_INTFAULT0 0x00010000 // Interrupt Fault PWM 0
#define PWM_RIS_INTPWM3   0x00000008 // PWM3 Interrupt Asserted
#define PWM_RIS_INTPWM2   0x00000004 // PWM2 Interrupt Asserted
#define PWM_RIS_INTPWM1   0x00000002 // PWM1 Interrupt Asserted
#define PWM_RIS_INTPWM0   0x00000001 // PWM0 Interrupt Asserted

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_ISC register.
//
//*****************************************************************************
#define PWM_ISC_INTFAULT3 0x00080000 // FAULT3 Interrupt Asserted
#define PWM_ISC_INTFAULT2 0x00040000 // FAULT2 Interrupt Asserted
#define PWM_ISC_INTFAULT1 0x00020000 // FAULT1 Interrupt Asserted
#define PWM_ISC_INTFAULT0 0x00010000 // FAULT0 Interrupt Asserted
#define PWM_ISC_INTPWM3   0x00000008 // PWM3 Interrupt Status
#define PWM_ISC_INTPWM2   0x00000004 // PWM2 Interrupt Status
#define PWM_ISC_INTPWM1   0x00000002 // PWM1 Interrupt Status
#define PWM_ISC_INTPWM0   0x00000001 // PWM0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_STATUS register.
//
//*****************************************************************************
#define PWM_STATUS_FAULT3 0x00000008 // Generator 3 Fault Status
#define PWM_STATUS_FAULT2 0x00000004 // Generator 2 Fault Status
#define PWM_STATUS_FAULT1 0x00000002 // Generator 1 Fault Status
#define PWM_STATUS_FAULT0 0x00000001 // Generator 0 Fault Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_FAULTVAL register.
//
//*****************************************************************************
#define PWM_FAULTVAL_PWM7 0x00000080 // MnPWM7 Fault Value
#define PWM_FAULTVAL_PWM6 0x00000040 // MnPWM6 Fault Value
#define PWM_FAULTVAL_PWM5 0x00000020 // MnPWM5 Fault Value
#define PWM_FAULTVAL_PWM4 0x00000010 // MnPWM4 Fault Value
#define PWM_FAULTVAL_PWM3 0x00000008 // MnPWM3 Fault Value
#define PWM_FAULTVAL_PWM2 0x00000004 // MnPWM2 Fault Value
#define PWM_FAULTVAL_PWM1 0x00000002 // MnPWM1 Fault Value
#define PWM_FAULTVAL_PWM0 0x00000001 // MnPWM0 Fault Value

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_ENUPD register.
//
//*****************************************************************************
#define PWM_ENUPD_ENUPD7_M     0x0000C000 // MnPWM7 Enable Update Mode
#define PWM_ENUPD_ENUPD7_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD7_LSYNC 0x00008000 // Locally Synchronized
#define PWM_ENUPD_ENUPD7_GSYNC 0x0000C000 // Globally Synchronized
#define PWM_ENUPD_ENUPD6_M     0x00003000 // MnPWM6 Enable Update Mode
#define PWM_ENUPD_ENUPD6_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD6_LSYNC 0x00002000 // Locally Synchronized
#define PWM_ENUPD_ENUPD6_GSYNC 0x00003000 // Globally Synchronized
#define PWM_ENUPD_ENUPD5_M     0x00000C00 // MnPWM5 Enable Update Mode
#define PWM_ENUPD_ENUPD5_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD5_LSYNC 0x00000800 // Locally Synchronized
#define PWM_ENUPD_ENUPD5_GSYNC 0x00000C00 // Globally Synchronized
#define PWM_ENUPD_ENUPD4_M     0x00000300 // MnPWM4 Enable Update Mode
#define PWM_ENUPD_ENUPD4_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD4_LSYNC 0x00000200 // Locally Synchronized
#define PWM_ENUPD_ENUPD4_GSYNC 0x00000300 // Globally Synchronized
#define PWM_ENUPD_ENUPD3_M     0x000000C0 // MnPWM3 Enable Update Mode
#define PWM_ENUPD_ENUPD3_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD3_LSYNC 0x00000080 // Locally Synchronized
#define PWM_ENUPD_ENUPD3_GSYNC 0x000000C0 // Globally Synchronized
#define PWM_ENUPD_ENUPD2_M     0x00000030 // MnPWM2 Enable Update Mode
#define PWM_ENUPD_ENUPD2_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD2_LSYNC 0x00000020 // Locally Synchronized
#define PWM_ENUPD_ENUPD2_GSYNC 0x00000030 // Globally Synchronized
#define PWM_ENUPD_ENUPD1_M     0x0000000C // MnPWM1 Enable Update Mode
#define PWM_ENUPD_ENUPD1_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD1_LSYNC 0x00000008 // Locally Synchronized
#define PWM_ENUPD_ENUPD1_GSYNC 0x0000000C // Globally Synchronized
#define PWM_ENUPD_ENUPD0_M     0x00000003 // MnPWM0 Enable Update Mode
#define PWM_ENUPD_ENUPD0_IMM   0x00000000 // Immediate
#define PWM_ENUPD_ENUPD0_LSYNC 0x00000002 // Locally Synchronized
#define PWM_ENUPD_ENUPD0_GSYNC 0x00000003 // Globally Synchronized

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_CTL register.
//
//*****************************************************************************
#define PWM_0_CTL_LATCH        0x00040000 // Latch Fault Input
#define PWM_0_CTL_MINFLTPER    0x00020000 // Minimum Fault Period
#define PWM_0_CTL_FLTSRC       0x00010000 // Fault Condition Source
#define PWM_0_CTL_DBFALLUPD_M  0x0000C000 // PWMnDBFALL Update Mode
#define PWM_0_CTL_DBFALLUPD_I  0x00000000 // Immediate
#define PWM_0_CTL_DBFALLUPD_LS 0x00008000 // Locally Synchronized
#define PWM_0_CTL_DBFALLUPD_GS 0x0000C000 // Globally Synchronized
#define PWM_0_CTL_DBRISEUPD_M  0x00003000 // PWMnDBRISE Update Mode
#define PWM_0_CTL_DBRISEUPD_I  0x00000000 // Immediate
#define PWM_0_CTL_DBRISEUPD_LS 0x00002000 // Locally Synchronized
#define PWM_0_CTL_DBRISEUPD_GS 0x00003000 // Globally Synchronized
#define PWM_0_CTL_DBCTLUPD_M   0x00000C00 // PWMnDBCTL Update Mode
#define PWM_0_CTL_DBCTLUPD_I   0x00000000 // Immediate
#define PWM_0_CTL_DBCTLUPD_LS  0x00000800 // Locally Synchronized
#define PWM_0_CTL_DBCTLUPD_GS  0x00000C00 // Globally Synchronized
#define PWM_0_CTL_GENBUPD_M    0x00000300 // PWMnGENB Update Mode
#define PWM_0_CTL_GENBUPD_I    0x00000000 // Immediate
#define PWM_0_CTL_GENBUPD_LS   0x00000200 // Locally Synchronized
#define PWM_0_CTL_GENBUPD_GS   0x00000300 // Globally Synchronized
#define PWM_0_CTL_GENAUPD_M    0x000000C0 // PWMnGENA Update Mode
#define PWM_0_CTL_GENAUPD_I    0x00000000 // Immediate
#define PWM_0_CTL_GENAUPD_LS   0x00000080 // Locally Synchronized
#define PWM_0_CTL_GENAUPD_GS   0x000000C0 // Globally Synchronized
#define PWM_0_CTL_CMPBUPD      0x00000020 // Comparator B Update Mode
#define PWM_0_CTL_CMPAUPD      0x00000010 // Comparator A Update Mode
#define PWM_0_CTL_LOADUPD      0x00000008 // Load Register Update Mode
#define PWM_0_CTL_DEBUG        0x00000004 // Debug Mode
#define PWM_0_CTL_MODE         0x00000002 // Counter Mode
#define PWM_0_CTL_ENABLE       0x00000001 // PWM Block Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_INTEN register.
//
//*****************************************************************************
#define PWM_0_INTEN_TRCMPBD \
    0x00002000                            // Trigger for Counter=PWMnCMPB
                                          // Down
#define PWM_0_INTEN_TRCMPBU 0x00001000    // Trigger for Counter=PWMnCMPB Up
#define PWM_0_INTEN_TRCMPAD \
    0x00000800                            // Trigger for Counter=PWMnCMPA
                                          // Down
#define PWM_0_INTEN_TRCMPAU   0x00000400  // Trigger for Counter=PWMnCMPA Up
#define PWM_0_INTEN_TRCNTLOAD 0x00000200  // Trigger for Counter=PWMnLOAD
#define PWM_0_INTEN_TRCNTZERO 0x00000100  // Trigger for Counter=0
#define PWM_0_INTEN_INTCMPBD \
    0x00000020                            // Interrupt for Counter=PWMnCMPB
                                          // Down
#define PWM_0_INTEN_INTCMPBU \
    0x00000010                            // Interrupt for Counter=PWMnCMPB
                                          // Up
#define PWM_0_INTEN_INTCMPAD \
    0x00000008                            // Interrupt for Counter=PWMnCMPA
                                          // Down
#define PWM_0_INTEN_INTCMPAU \
    0x00000004                            // Interrupt for Counter=PWMnCMPA
                                          // Up
#define PWM_0_INTEN_INTCNTLOAD 0x00000002 // Interrupt for Counter=PWMnLOAD
#define PWM_0_INTEN_INTCNTZERO 0x00000001 // Interrupt for Counter=0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_RIS register.
//
//*****************************************************************************
#define PWM_0_RIS_INTCMPBD \
    0x00000020                          // Comparator B Down Interrupt
                                        // Status
#define PWM_0_RIS_INTCMPBU 0x00000010   // Comparator B Up Interrupt Status
#define PWM_0_RIS_INTCMPAD \
    0x00000008                          // Comparator A Down Interrupt
                                        // Status
#define PWM_0_RIS_INTCMPAU   0x00000004 // Comparator A Up Interrupt Status
#define PWM_0_RIS_INTCNTLOAD 0x00000002 // Counter=Load Interrupt Status
#define PWM_0_RIS_INTCNTZERO 0x00000001 // Counter=0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_ISC register.
//
//*****************************************************************************
#define PWM_0_ISC_INTCMPBD   0x00000020 // Comparator B Down Interrupt
#define PWM_0_ISC_INTCMPBU   0x00000010 // Comparator B Up Interrupt
#define PWM_0_ISC_INTCMPAD   0x00000008 // Comparator A Down Interrupt
#define PWM_0_ISC_INTCMPAU   0x00000004 // Comparator A Up Interrupt
#define PWM_0_ISC_INTCNTLOAD 0x00000002 // Counter=Load Interrupt
#define PWM_0_ISC_INTCNTZERO 0x00000001 // Counter=0 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_LOAD register.
//
//*****************************************************************************
#define PWM_0_LOAD_M 0x0000FFFF // Counter Load Value
#define PWM_0_LOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_COUNT register.
//
//*****************************************************************************
#define PWM_0_COUNT_M 0x0000FFFF // Counter Value
#define PWM_0_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_CMPA register.
//
//*****************************************************************************
#define PWM_0_CMPA_M 0x0000FFFF // Comparator A Value
#define PWM_0_CMPA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_CMPB register.
//
//*****************************************************************************
#define PWM_0_CMPB_M 0x0000FFFF // Comparator B Value
#define PWM_0_CMPB_S 0

