fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_pwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_RIS register.
//
//*****************************************************************************
#define PWM_2_RIS_INTCMPBD \
    0x00000020                          // Comparator B Down Interrupt
                                        // Status
#define PWM_2_RIS_INTCMPBU 0x00000010   // Comparator B Up Interrupt Status
#define PWM_2_RIS_INTCMPAD \
    0x00000008                          // Comparator A Down Interrupt
                                        // Status
#define PWM_2_RIS_INTCMPAU   0x00000004 // Comparator A Up Interrupt Status
#define PWM_2_RIS_INTCNTLOAD 0x00000002 // Counter=Load Interrupt Status
#define PWM_2_RIS_INTCNTZERO 0x00000001 // Counter=0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_ISC register.
//
//*****************************************************************************
#define PWM_2_ISC_INTCMPBD   0x00000020 // Comparator B Down Interrupt
#define PWM_2_ISC_INTCMPBU   0x00000010 // Comparator B Up Interrupt
#define PWM_2_ISC_INTCMPAD   0x00000008 // Comparator A Down Interrupt
#define PWM_2_ISC_INTCMPAU   0x00000004 // Comparator A Up Interrupt
#define PWM_2_ISC_INTCNTLOAD 0x00000002 // Counter=Load Interrupt
#define PWM_2_ISC_INTCNTZERO 0x00000001 // Counter=0 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_LOAD register.
//
//*****************************************************************************
#define PWM_2_LOAD_LOAD_M 0x0000FFFF // Counter Load Value
#define PWM_2_LOAD_LOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_COUNT register.
//
//*****************************************************************************
#define PWM_2_COUNT_COUNT_M 0x0000FFFF // Counter Value
#define PWM_2_COUNT_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_CMPA register.
//
//*****************************************************************************
#define PWM_2_CMPA_COMPA_M 0x0000FFFF // Comparator A Value
#define PWM_2_CMPA_COMPA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_CMPB register.
//
//*****************************************************************************
#define PWM_2_CMPB_COMPB_M 0x0000FFFF // Comparator B Value
#define PWM_2_CMPB_COMPB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_GENA register.
//
//*****************************************************************************
#define PWM_2_GENA_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_2_GENA_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_2_GENA_ACTCMPBD_INV  0x00000400 // Invert pwmA
#define PWM_2_GENA_ACTCMPBD_ZERO 0x00000800 // Drive pwmA Low
#define PWM_2_GENA_ACTCMPBD_ONE  0x00000C00 // Drive pwmA High
#define PWM_2_GENA_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_2_GENA_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_2_GENA_ACTCMPBU_INV  0x00000100 // Invert pwmA
#define PWM_2_GENA_ACTCMPBU_ZERO 0x00000200 // Drive pwmA Low
#define PWM_2_GENA_ACTCMPBU_ONE  0x00000300 // Drive pwmA High
#define PWM_2_GENA_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_2_GENA_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_2_GENA_ACTCMPAD_INV  0x00000040 // Invert pwmA
#define PWM_2_GENA_ACTCMPAD_ZERO 0x00000080 // Drive pwmA Low
#define PWM_2_GENA_ACTCMPAD_ONE  0x000000C0 // Drive pwmA High
#define PWM_2_GENA_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_2_GENA_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_2_GENA_ACTCMPAU_INV  0x00000010 // Invert pwmA
#define PWM_2_GENA_ACTCMPAU_ZERO 0x00000020 // Drive pwmA Low
#define PWM_2_GENA_ACTCMPAU_ONE  0x00000030 // Drive pwmA High
#define PWM_2_GENA_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_2_GENA_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_2_GENA_ACTLOAD_INV   0x00000004 // Invert pwmA
#define PWM_2_GENA_ACTLOAD_ZERO  0x00000008 // Drive pwmA Low
#define PWM_2_GENA_ACTLOAD_ONE   0x0000000C // Drive pwmA High
#define PWM_2_GENA_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_2_GENA_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_2_GENA_ACTZERO_INV   0x00000001 // Invert pwmA
#define PWM_2_GENA_ACTZERO_ZERO  0x00000002 // Drive pwmA Low
#define PWM_2_GENA_ACTZERO_ONE   0x00000003 // Drive pwmA High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_GENB register.
//
//*****************************************************************************
#define PWM_2_GENB_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_2_GENB_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_2_GENB_ACTCMPBD_INV  0x00000400 // Invert pwmB
#define PWM_2_GENB_ACTCMPBD_ZERO 0x00000800 // Drive pwmB Low
#define PWM_2_GENB_ACTCMPBD_ONE  0x00000C00 // Drive pwmB High
#define PWM_2_GENB_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_2_GENB_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_2_GENB_ACTCMPBU_INV  0x00000100 // Invert pwmB
#define PWM_2_GENB_ACTCMPBU_ZERO 0x00000200 // Drive pwmB Low
#define PWM_2_GENB_ACTCMPBU_ONE  0x00000300 // Drive pwmB High
#define PWM_2_GENB_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_2_GENB_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_2_GENB_ACTCMPAD_INV  0x00000040 // Invert pwmB
#define PWM_2_GENB_ACTCMPAD_ZERO 0x00000080 // Drive pwmB Low
#define PWM_2_GENB_ACTCMPAD_ONE  0x000000C0 // Drive pwmB High
#define PWM_2_GENB_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_2_GENB_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_2_GENB_ACTCMPAU_INV  0x00000010 // Invert pwmB
#define PWM_2_GENB_ACTCMPAU_ZERO 0x00000020 // Drive pwmB Low
#define PWM_2_GENB_ACTCMPAU_ONE  0x00000030 // Drive pwmB High
#define PWM_2_GENB_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_2_GENB_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_2_GENB_ACTLOAD_INV   0x00000004 // Invert pwmB
#define PWM_2_GENB_ACTLOAD_ZERO  0x00000008 // Drive pwmB Low
#define PWM_2_GENB_ACTLOAD_ONE   0x0000000C // Drive pwmB High
#define PWM_2_GENB_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_2_GENB_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_2_GENB_ACTZERO_INV   0x00000001 // Invert pwmB
#define PWM_2_GENB_ACTZERO_ZERO  0x00000002 // Drive pwmB Low
#define PWM_2_GENB_ACTZERO_ONE   0x00000003 // Drive pwmB High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_DBCTL register.
//
//*****************************************************************************
#define PWM_2_DBCTL_ENABLE 0x00000001 // Dead-Band Generator Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_DBRISE register.
//
//*****************************************************************************
#define PWM_2_DBRISE_RISEDELAY_M 0x00000FFF // Dead-Band Rise Delay
#define PWM_2_DBRISE_RISEDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_DBFALL register.
//
//*****************************************************************************
#define PWM_2_DBFALL_FALLDELAY_M 0x00000FFF // Dead-Band Fall Delay
#define PWM_2_DBFALL_FALLDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSRC0
// register.
//
//*****************************************************************************
#define PWM_2_FLTSRC0_FAULT3 0x00000008 // Fault3 Input
#define PWM_2_FLTSRC0_FAULT2 0x00000004 // Fault2 Input
#define PWM_2_FLTSRC0_FAULT1 0x00000002 // Fault1 Input
#define PWM_2_FLTSRC0_FAULT0 0x00000001 // Fault0 Input

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSRC1
// register.
//
//*****************************************************************************
#define PWM_2_FLTSRC1_DCMP7 0x00000080 // Digital Comparator 7
#define PWM_2_FLTSRC1_DCMP6 0x00000040 // Digital Comparator 6
#define PWM_2_FLTSRC1_DCMP5 0x00000020 // Digital Comparator 5
#define PWM_2_FLTSRC1_DCMP4 0x00000010 // Digital Comparator 4
#define PWM_2_FLTSRC1_DCMP3 0x00000008 // Digital Comparator 3
#define PWM_2_FLTSRC1_DCMP2 0x00000004 // Digital Comparator 2
#define PWM_2_FLTSRC1_DCMP1 0x00000002 // Digital Comparator 1
#define PWM_2_FLTSRC1_DCMP0 0x00000001 // Digital Comparator 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_MINFLTPER
// register.
//
//*****************************************************************************
#define PWM_2_MINFLTPER_MFP_M 0x0000FFFF // Minimum Fault Period
#define PWM_2_MINFLTPER_MFP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_CTL register.
//
//*****************************************************************************
#define PWM_3_CTL_LATCH        0x00040000 // Latch Fault Input
#define PWM_3_CTL_MINFLTPER    0x00020000 // Minimum Fault Period
#define PWM_3_CTL_FLTSRC       0x00010000 // Fault Condition Source
#define PWM_3_CTL_DBFALLUPD_M  0x0000C000 // PWMnDBFALL Update Mode
#define PWM_3_CTL_DBFALLUPD_I  0x00000000 // Immediate
#define PWM_3_CTL_DBFALLUPD_LS 0x00008000 // Locally Synchronized
#define PWM_3_CTL_DBFALLUPD_GS 0x0000C000 // Globally Synchronized
#define PWM_3_CTL_DBRISEUPD_M  0x00003000 // PWMnDBRISE Update Mode
#define PWM_3_CTL_DBRISEUPD_I  0x00000000 // Immediate
#define PWM_3_CTL_DBRISEUPD_LS 0x00002000 // Locally Synchronized
#define PWM_3_CTL_DBRISEUPD_GS 0x00003000 // Globally Synchronized
#define PWM_3_CTL_DBCTLUPD_M   0x00000C00 // PWMnDBCTL Update Mode
#define PWM_3_CTL_DBCTLUPD_I   0x00000000 // Immediate
#define PWM_3_CTL_DBCTLUPD_LS  0x00000800 // Locally Synchronized
#define PWM_3_CTL_DBCTLUPD_GS  0x00000C00 // Globally Synchronized
#define PWM_3_CTL_GENBUPD_M    0x00000300 // PWMnGENB Update Mode
#define PWM_3_CTL_GENBUPD_I    0x00000000 // Immediate
#define PWM_3_CTL_GENBUPD_LS   0x00000200 // Locally Synchronized
#define PWM_3_CTL_GENBUPD_GS   0x00000300 // Globally Synchronized
#define PWM_3_CTL_GENAUPD_M    0x000000C0 // PWMnGENA Update Mode
#define PWM_3_CTL_GENAUPD_I    0x00000000 // Immediate
#define PWM_3_CTL_GENAUPD_LS   0x00000080 // Locally Synchronized
#define PWM_3_CTL_GENAUPD_GS   0x000000C0 // Globally Synchronized
#define PWM_3_CTL_CMPBUPD      0x00000020 // Comparator B Update Mode
#define PWM_3_CTL_CMPAUPD      0x00000010 // Comparator A Update Mode
#define PWM_3_CTL_LOADUPD      0x00000008 // Load Register Update Mode
#define PWM_3_CTL_DEBUG        0x00000004 // Debug Mode
#define PWM_3_CTL_MODE         0x00000002 // Counter Mode
#define PWM_3_CTL_ENABLE       0x00000001 // PWM Block Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_INTEN register.
//
//*****************************************************************************
#define PWM_3_INTEN_TRCMPBD \
    0x00002000                            // Trigger for Counter=PWMnCMPB
                                          // Down
#define PWM_3_INTEN_TRCMPBU 0x00001000    // Trigger for Counter=PWMnCMPB Up
#define PWM_3_INTEN_TRCMPAD \
    0x00000800                            // Trigger for Counter=PWMnCMPA
                                          // Down
#define PWM_3_INTEN_TRCMPAU   0x00000400  // Trigger for Counter=PWMnCMPA Up
#define PWM_3_INTEN_TRCNTLOAD 0x00000200  // Trigger for Counter=PWMnLOAD
#define PWM_3_INTEN_TRCNTZERO 0x00000100  // Trigger for Counter=0
#define PWM_3_INTEN_INTCMPBD \
    0x00000020                            // Interrupt for Counter=PWMnCMPB
                                          // Down
#define PWM_3_INTEN_INTCMPBU \
    0x00000010                            // Interrupt for Counter=PWMnCMPB
                                          // Up
#define PWM_3_INTEN_INTCMPAD \
    0x00000008                            // Interrupt for Counter=PWMnCMPA
                                          // Down
#define PWM_3_INTEN_INTCMPAU \
    0x00000004                            // Interrupt for Counter=PWMnCMPA
                                          // Up
#define PWM_3_INTEN_INTCNTLOAD 0x00000002 // Interrupt for Counter=PWMnLOAD
#define PWM_3_INTEN_INTCNTZERO 0x00000001 // Interrupt for Counter=0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_RIS register.
//
//*****************************************************************************
#define PWM_3_RIS_INTCMPBD \
    0x00000020                          // Comparator B Down Interrupt
                                        // Status
#define PWM_3_RIS_INTCMPBU 0x00000010   // Comparator B Up Interrupt Status
#define PWM_3_RIS_INTCMPAD \
    0x00000008                          // Comparator A Down Interrupt
                                        // Status
#define PWM_3_RIS_INTCMPAU   0x00000004 // Comparator A Up Interrupt Status
#define PWM_3_RIS_INTCNTLOAD 0x00000002 // Counter=Load Interrupt Status
#define PWM_3_RIS_INTCNTZERO 0x00000001 // Counter=0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_ISC register.
//
//*****************************************************************************
#define PWM_3_ISC_INTCMPBD   0x00000020 // Comparator B Down Interrupt
#define PWM_3_ISC_INTCMPBU   0x00000010 // Comparator B Up Interrupt
#define PWM_3_ISC_INTCMPAD   0x00000008 // Comparator A Down Interrupt
#define PWM_3_ISC_INTCMPAU   0x00000004 // Comparator A Up Interrupt
#define PWM_3_ISC_INTCNTLOAD 0x00000002 // Counter=Load Interrupt
#define PWM_3_ISC_INTCNTZERO 0x00000001 // Counter=0 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_LOAD register.
//
//*****************************************************************************
#define PWM_3_LOAD_LOAD_M 0x0000FFFF // Counter Load Value
#define PWM_3_LOAD_LOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_COUNT register.
//
//*****************************************************************************
#define PWM_3_COUNT_COUNT_M 0x0000FFFF // Counter Value
#define PWM_3_COUNT_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_CMPA register.
//
//*****************************************************************************
#define PWM_3_CMPA_COMPA_M 0x0000FFFF // Comparator A Value
#define PWM_3_CMPA_COMPA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_CMPB register.
//
//*****************************************************************************
#define PWM_3_CMPB_COMPB_M 0x0000FFFF // Comparator B Value
#define PWM_3_CMPB_COMPB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_GENA register.
//
//*****************************************************************************
#define PWM_3_GENA_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_3_GENA_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_3_GENA_ACTCMPBD_INV  0x00000400 // Invert pwmA
#define PWM_3_GENA_ACTCMPBD_ZERO 0x00000800 // Drive pwmA Low
#define PWM_3_GENA_ACTCMPBD_ONE  0x00000C00 // Drive pwmA High
#define PWM_3_GENA_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_3_GENA_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_3_GENA_ACTCMPBU_INV  0x00000100 // Invert pwmA
#define PWM_3_GENA_ACTCMPBU_ZERO 0x00000200 // Drive pwmA Low
#define PWM_3_GENA_ACTCMPBU_ONE  0x00000300 // Drive pwmA High
#define PWM_3_GENA_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_3_GENA_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_3_GENA_ACTCMPAD_INV  0x00000040 // Invert pwmA
#define PWM_3_GENA_ACTCMPAD_ZERO 0x00000080 // Drive pwmA Low
#define PWM_3_GENA_ACTCMPAD_ONE  0x000000C0 // Drive pwmA High
#define PWM_3_GENA_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_3_GENA_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_3_GENA_ACTCMPAU_INV  0x00000010 // Invert pwmA
#define PWM_3_GENA_ACTCMPAU_ZERO 0x00000020 // Drive pwmA Low
#define PWM_3_GENA_ACTCMPAU_ONE  0x00000030 // Drive pwmA High
#define PWM_3_GENA_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_3_GENA_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_3_GENA_ACTLOAD_INV   0x00000004 // Invert pwmA
#define PWM_3_GENA_ACTLOAD_ZERO  0x00000008 // Drive pwmA Low
#define PWM_3_GENA_ACTLOAD_ONE   0x0000000C // Drive pwmA High
#define PWM_3_GENA_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_3_GENA_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_3_GENA_ACTZERO_INV   0x00000001 // Invert pwmA
#define PWM_3_GENA_ACTZERO_ZERO  0x00000002 // Drive pwmA Low
#define PWM_3_GENA_ACTZERO_ONE   0x00000003 // Drive pwmA High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_GENB register.
//
//*****************************************************************************
#define PWM_3_GENB_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_3_GENB_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPBD_INV  0x00000400 // Invert pwmB
#define PWM_3_GENB_ACTCMPBD_ZERO 0x00000800 // Drive pwmB Low
#define PWM_3_GENB_ACTCMPBD_ONE  0x00000C00 // Drive pwmB High
#define PWM_3_GENB_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_3_GENB_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPBU_INV  0x00000100 // Invert pwmB
#define PWM_3_GENB_ACTCMPBU_ZERO 0x00000200 // Drive pwmB Low
#define PWM_3_GENB_ACTCMPBU_ONE  0x00000300 // Drive pwmB High
#define PWM_3_GENB_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_3_GENB_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPAD_INV  0x00000040 // Invert pwmB
#define PWM_3_GENB_ACTCMPAD_ZERO 0x00000080 // Drive pwmB Low
#define PWM_3_GENB_ACTCMPAD_ONE  0x000000C0 // Drive pwmB High
#define PWM_3_GENB_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_3_GENB_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPAU_INV  0x00000010 // Invert pwmB
#define PWM_3_GENB_ACTCMPAU_ZERO 0x00000020 // Drive pwmB Low
#define PWM_3_GENB_ACTCMPAU_ONE  0x00000030 // Drive pwmB High
#define PWM_3_GENB_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_3_GENB_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_3_GENB_ACTLOAD_INV   0x00000004 // Invert pwmB
#define PWM_3_GENB_ACTLOAD_ZERO  0x00000008 // Drive pwmB Low
#define PWM_3_GENB_ACTLOAD_ONE   0x0000000C // Drive pwmB High
#define PWM_3_GENB_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_3_GENB_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_3_GENB_ACTZERO_INV   0x00000001 // Invert pwmB
#define PWM_3_GENB_ACTZERO_ZERO  0x00000002 // Drive pwmB Low
#define PWM_3_GENB_ACTZERO_ONE   0x00000003 // Drive pwmB High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBCTL register.
//
//*****************************************************************************
#define PWM_3_DBCTL_ENABLE 0x00000001 // Dead-Band Generator Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBRISE register.
//
//*****************************************************************************
#define PWM_3_DBRISE_RISEDELAY_M 0x00000FFF // Dead-Band Rise Delay
#define PWM_3_DBRISE_RISEDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBFALL register.
//
//*****************************************************************************
#define PWM_3_DBFALL_FALLDELAY_M 0x00000FFF // Dead-Band Fall Delay
#define PWM_3_DBFALL_FALLDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSRC0
// register.
//
//*****************************************************************************
#define PWM_3_FLTSRC0_FAULT3 0x00000008 // Fault3 Input
#define PWM_3_FLTSRC0_FAULT2 0x00000004 // Fault2 Input
#define PWM_3_FLTSRC0_FAULT1 0x00000002 // Fault1 Input
#define PWM_3_FLTSRC0_FAULT0 0x00000001 // Fault0 Input

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSRC1
// register.
//
//*****************************************************************************
#define PWM_3_FLTSRC1_DCMP7 0x00000080 // Digital Comparator 7
#define PWM_3_FLTSRC1_DCMP6 0x00000040 // Digital Comparator 6
#define PWM_3_FLTSRC1_DCMP5 0x00000020 // Digital Comparator 5
#define PWM_3_FLTSRC1_DCMP4 0x00000010 // Digital Comparator 4
#define PWM_3_FLTSRC1_DCMP3 0x00000008 // Digital Comparator 3
#define PWM_3_FLTSRC1_DCMP2 0x00000004 // Digital Comparator 2
#define PWM_3_FLTSRC1_DCMP1 0x00000002 // Digital Comparator 1
#define PWM_3_FLTSRC1_DCMP0 0x00000001 // Digital Comparator 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_MINFLTPER
// register.
//
//*****************************************************************************
#define PWM_3_MINFLTPER_MFP_M 0x0000FFFF // Minimum Fault Period
#define PWM_3_MINFLTPER_MFP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSEN register.
//
//*****************************************************************************
#define PWM_0_FLTSEN_FAULT3 0x00000008 // Fault3 Sense
#define PWM_0_FLTSEN_FAULT2 0x00000004 // Fault2 Sense
#define PWM_0_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_0_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

