fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_pwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_0_FLTSTAT0_FAULT3 0x00000008 // Fault Input 3
#define PWM_0_FLTSTAT0_FAULT2 0x00000004 // Fault Input 2
#define PWM_0_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_0_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_0_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_0_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_0_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_0_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_0_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_0_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_0_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_0_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSEN register.
//
//*****************************************************************************
#define PWM_1_FLTSEN_FAULT3 0x00000008 // Fault3 Sense
#define PWM_1_FLTSEN_FAULT2 0x00000004 // Fault2 Sense
#define PWM_1_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_1_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_1_FLTSTAT0_FAULT3 0x00000008 // Fault Input 3
#define PWM_1_FLTSTAT0_FAULT2 0x00000004 // Fault Input 2
#define PWM_1_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_1_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_1_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_1_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_1_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_1_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_1_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_1_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_1_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_1_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSEN register.
//
//*****************************************************************************
#define PWM_2_FLTSEN_FAULT3 0x00000008 // Fault3 Sense
#define PWM_2_FLTSEN_FAULT2 0x00000004 // Fault2 Sense
#define PWM_2_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_2_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_2_FLTSTAT0_FAULT3 0x00000008 // Fault Input 3
#define PWM_2_FLTSTAT0_FAULT2 0x00000004 // Fault Input 2
#define PWM_2_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_2_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_2_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_2_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_2_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_2_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_2_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_2_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_2_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_2_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSEN register.
//
//*****************************************************************************
#define PWM_3_FLTSEN_FAULT3 0x00000008 // Fault3 Sense
#define PWM_3_FLTSEN_FAULT2 0x00000004 // Fault2 Sense
#define PWM_3_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_3_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_3_FLTSTAT0_FAULT3 0x00000008 // Fault Input 3
#define PWM_3_FLTSTAT0_FAULT2 0x00000004 // Fault Input 2
#define PWM_3_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_3_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_3_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_3_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_3_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_3_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_3_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_3_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_3_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_3_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_PP register.
//
//*****************************************************************************
#define PWM_PP_GCNT_M 0x0000000F // Generators
#define PWM_PP_FCNT_M 0x000000F0 // Fault Inputs (per PWM unit)
#define PWM_PP_ESYNC  0x00000100 // Extended Synchronization
#define PWM_PP_EFAULT 0x00000200 // Extended Fault
#define PWM_PP_ONE    0x00000400 // One-Shot Mode
#define PWM_PP_GCNT_S 0
#define PWM_PP_FCNT_S 4

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_CC register.
//
//*****************************************************************************
#define PWM_CC_USEPWM    0x00000100 // Use PWM Clock Divisor
#define PWM_CC_PWMDIV_M  0x00000007 // PWM Clock Divider
#define PWM_CC_PWMDIV_2  0x00000000 // /2
#define PWM_CC_PWMDIV_4  0x00000001 // /4
#define PWM_CC_PWMDIV_8  0x00000002 // /8
#define PWM_CC_PWMDIV_16 0x00000003 // /16
#define PWM_CC_PWMDIV_32 0x00000004 // /32
#define PWM_CC_PWMDIV_64 0x00000005 // /64

//*****************************************************************************
//
// The following are defines for the PWM Generator standard offsets.
//
//*****************************************************************************
#define PWM_O_X_CTL       0x00000000 // Gen Control Reg
#define PWM_O_X_INTEN     0x00000004 // Gen Int/Trig Enable Reg
#define PWM_O_X_RIS       0x00000008 // Gen Raw Int Status Reg
#define PWM_O_X_ISC       0x0000000C // Gen Int Status Reg
#define PWM_O_X_LOAD      0x00000010 // Gen Load Reg
#define PWM_O_X_COUNT     0x00000014 // Gen Counter Reg
#define PWM_O_X_CMPA      0x00000018 // Gen Compare A Reg
#define PWM_O_X_CMPB      0x0000001C // Gen Compare B Reg
#define PWM_O_X_GENA      0x00000020 // Gen Generator A Ctrl Reg
#define PWM_O_X_GENB      0x00000024 // Gen Generator B Ctrl Reg
#define PWM_O_X_DBCTL     0x00000028 // Gen Dead Band Ctrl Reg
#define PWM_O_X_DBRISE    0x0000002C // Gen DB Rising Edge Delay Reg
#define PWM_O_X_DBFALL    0x00000030 // Gen DB Falling Edge Delay Reg
#define PWM_O_X_FLTSRC0   0x00000034 // Fault pin, comparator condition
#define PWM_O_X_FLTSRC1   0x00000038 // Digital comparator condition
#define PWM_O_X_MINFLTPER 0x0000003C // Fault minimum period extension
#define PWM_GEN_0_OFFSET  0x00000040 // PWM0 base
#define PWM_GEN_1_OFFSET  0x00000080 // PWM1 base
#define PWM_GEN_2_OFFSET  0x000000C0 // PWM2 base
#define PWM_GEN_3_OFFSET  0x00000100 // PWM3 base

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_CTL register.
//
//*****************************************************************************
#define PWM_X_CTL_LATCH        0x00040000 // Latch Fault Input
#define PWM_X_CTL_MINFLTPER    0x00020000 // Minimum Fault Period
#define PWM_X_CTL_FLTSRC       0x00010000 // Fault Condition Source
#define PWM_X_CTL_DBFALLUPD_M  0x0000C000 // PWMnDBFALL Update Mode
#define PWM_X_CTL_DBFALLUPD_I  0x00000000 // Immediate
#define PWM_X_CTL_DBFALLUPD_LS 0x00008000 // Locally Synchronized
#define PWM_X_CTL_DBFALLUPD_GS 0x0000C000 // Globally Synchronized
#define PWM_X_CTL_DBRISEUPD_M  0x00003000 // PWMnDBRISE Update Mode
#define PWM_X_CTL_DBRISEUPD_I  0x00000000 // Immediate
#define PWM_X_CTL_DBRISEUPD_LS 0x00002000 // Locally Synchronized
#define PWM_X_CTL_DBRISEUPD_GS 0x00003000 // Globally Synchronized
#define PWM_X_CTL_DBCTLUPD_M   0x00000C00 // PWMnDBCTL Update Mode
#define PWM_X_CTL_DBCTLUPD_I   0x00000000 // Immediate
#define PWM_X_CTL_DBCTLUPD_LS  0x00000800 // Locally Synchronized
#define PWM_X_CTL_DBCTLUPD_GS  0x00000C00 // Globally Synchronized
#define PWM_X_CTL_GENBUPD_M    0x00000300 // PWMnGENB Update Mode
#define PWM_X_CTL_GENBUPD_I    0x00000000 // Immediate
#define PWM_X_CTL_GENBUPD_LS   0x00000200 // Locally Synchronized
#define PWM_X_CTL_GENBUPD_GS   0x00000300 // Globally Synchronized
#define PWM_X_CTL_GENAUPD_M    0x000000C0 // PWMnGENA Update Mode
#define PWM_X_CTL_GENAUPD_I    0x00000000 // Immediate
#define PWM_X_CTL_GENAUPD_LS   0x00000080 // Locally Synchronized
#define PWM_X_CTL_GENAUPD_GS   0x000000C0 // Globally Synchronized
#define PWM_X_CTL_CMPBUPD      0x00000020 // Comparator B Update Mode
#define PWM_X_CTL_CMPAUPD      0x00000010 // Comparator A Update Mode
#define PWM_X_CTL_LOADUPD      0x00000008 // Load Register Update Mode
#define PWM_X_CTL_DEBUG        0x00000004 // Debug Mode
#define PWM_X_CTL_MODE         0x00000002 // Counter Mode
#define PWM_X_CTL_ENABLE       0x00000001 // PWM Block Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_INTEN register.
//
//*****************************************************************************
#define PWM_X_INTEN_TRCMPBD \
    0x00002000                            // Trigger for Counter=PWMnCMPB
                                          // Down
#define PWM_X_INTEN_TRCMPBU 0x00001000    // Trigger for Counter=PWMnCMPB Up
#define PWM_X_INTEN_TRCMPAD \
    0x00000800                            // Trigger for Counter=PWMnCMPA
                                          // Down
#define PWM_X_INTEN_TRCMPAU   0x00000400  // Trigger for Counter=PWMnCMPA Up
#define PWM_X_INTEN_TRCNTLOAD 0x00000200  // Trigger for Counter=PWMnLOAD
#define PWM_X_INTEN_TRCNTZERO 0x00000100  // Trigger for Counter=0
#define PWM_X_INTEN_INTCMPBD \
    0x00000020                            // Interrupt for Counter=PWMnCMPB
                                          // Down
#define PWM_X_INTEN_INTCMPBU \
    0x00000010                            // Interrupt for Counter=PWMnCMPB
                                          // Up
#define PWM_X_INTEN_INTCMPAD \
    0x00000008                            // Interrupt for Counter=PWMnCMPA
                                          // Down
#define PWM_X_INTEN_INTCMPAU \
    0x00000004                            // Interrupt for Counter=PWMnCMPA
                                          // Up
#define PWM_X_INTEN_INTCNTLOAD 0x00000002 // Interrupt for Counter=PWMnLOAD
#define PWM_X_INTEN_INTCNTZERO 0x00000001 // Interrupt for Counter=0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_RIS register.
//
//*****************************************************************************
#define PWM_X_RIS_INTCMPBD \
    0x00000020                          // Comparator B Down Interrupt
                                        // Status
#define PWM_X_RIS_INTCMPBU 0x00000010   // Comparator B Up Interrupt Status
#define PWM_X_RIS_INTCMPAD \
    0x00000008                          // Comparator A Down Interrupt
                                        // Status
#define PWM_X_RIS_INTCMPAU   0x00000004 // Comparator A Up Interrupt Status
#define PWM_X_RIS_INTCNTLOAD 0x00000002 // Counter=Load Interrupt Status
#define PWM_X_RIS_INTCNTZERO 0x00000001 // Counter=0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_ISC register.
//
//*****************************************************************************
#define PWM_X_ISC_INTCMPBD   0x00000020 // Comparator B Down Interrupt
#define PWM_X_ISC_INTCMPBU   0x00000010 // Comparator B Up Interrupt
#define PWM_X_ISC_INTCMPAD   0x00000008 // Comparator A Down Interrupt
#define PWM_X_ISC_INTCMPAU   0x00000004 // Comparator A Up Interrupt
#define PWM_X_ISC_INTCNTLOAD 0x00000002 // Counter=Load Interrupt
#define PWM_X_ISC_INTCNTZERO 0x00000001 // Counter=0 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_LOAD register.
//
//*****************************************************************************
#define PWM_X_LOAD_M 0x0000FFFF // Counter Load Value
#define PWM_X_LOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_COUNT register.
//
//*****************************************************************************
#define PWM_X_COUNT_M 0x0000FFFF // Counter Value
#define PWM_X_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_CMPA register.
//
//*****************************************************************************
#define PWM_X_CMPA_M 0x0000FFFF // Comparator A Value
#define PWM_X_CMPA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_CMPB register.
//
//*****************************************************************************
#define PWM_X_CMPB_M 0x0000FFFF // Comparator B Value
#define PWM_X_CMPB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_GENA register.
//
//*****************************************************************************
#define PWM_X_GENA_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_X_GENA_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_X_GENA_ACTCMPBD_INV  0x00000400 // Invert pwmA
#define PWM_X_GENA_ACTCMPBD_ZERO 0x00000800 // Drive pwmA Low
#define PWM_X_GENA_ACTCMPBD_ONE  0x00000C00 // Drive pwmA High
#define PWM_X_GENA_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_X_GENA_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_X_GENA_ACTCMPBU_INV  0x00000100 // Invert pwmA
#define PWM_X_GENA_ACTCMPBU_ZERO 0x00000200 // Drive pwmA Low
#define PWM_X_GENA_ACTCMPBU_ONE  0x00000300 // Drive pwmA High
#define PWM_X_GENA_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_X_GENA_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_X_GENA_ACTCMPAD_INV  0x00000040 // Invert pwmA
#define PWM_X_GENA_ACTCMPAD_ZERO 0x00000080 // Drive pwmA Low
#define PWM_X_GENA_ACTCMPAD_ONE  0x000000C0 // Drive pwmA High
#define PWM_X_GENA_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_X_GENA_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_X_GENA_ACTCMPAU_INV  0x00000010 // Invert pwmA
#define PWM_X_GENA_ACTCMPAU_ZERO 0x00000020 // Drive pwmA Low
#define PWM_X_GENA_ACTCMPAU_ONE  0x00000030 // Drive pwmA High
#define PWM_X_GENA_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_X_GENA_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_X_GENA_ACTLOAD_INV   0x00000004 // Invert pwmA
#define PWM_X_GENA_ACTLOAD_ZERO  0x00000008 // Drive pwmA Low
#define PWM_X_GENA_ACTLOAD_ONE   0x0000000C // Drive pwmA High
#define PWM_X_GENA_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_X_GENA_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_X_GENA_ACTZERO_INV   0x00000001 // Invert pwmA
#define PWM_X_GENA_ACTZERO_ZERO  0x00000002 // Drive pwmA Low
#define PWM_X_GENA_ACTZERO_ONE   0x00000003 // Drive pwmA High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_GENB register.
//
//*****************************************************************************
#define PWM_X_GENB_ACTCMPBD_M    0x00000C00 // Action for Comparator B Down
#define PWM_X_GENB_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_X_GENB_ACTCMPBD_INV  0x00000400 // Invert pwmB
#define PWM_X_GENB_ACTCMPBD_ZERO 0x00000800 // Drive pwmB Low
#define PWM_X_GENB_ACTCMPBD_ONE  0x00000C00 // Drive pwmB High
#define PWM_X_GENB_ACTCMPBU_M    0x00000300 // Action for Comparator B Up
#define PWM_X_GENB_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_X_GENB_ACTCMPBU_INV  0x00000100 // Invert pwmB
#define PWM_X_GENB_ACTCMPBU_ZERO 0x00000200 // Drive pwmB Low
#define PWM_X_GENB_ACTCMPBU_ONE  0x00000300 // Drive pwmB High
#define PWM_X_GENB_ACTCMPAD_M    0x000000C0 // Action for Comparator A Down
#define PWM_X_GENB_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_X_GENB_ACTCMPAD_INV  0x00000040 // Invert pwmB
#define PWM_X_GENB_ACTCMPAD_ZERO 0x00000080 // Drive pwmB Low
#define PWM_X_GENB_ACTCMPAD_ONE  0x000000C0 // Drive pwmB High
#define PWM_X_GENB_ACTCMPAU_M    0x00000030 // Action for Comparator A Up
#define PWM_X_GENB_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_X_GENB_ACTCMPAU_INV  0x00000010 // Invert pwmB
#define PWM_X_GENB_ACTCMPAU_ZERO 0x00000020 // Drive pwmB Low
#define PWM_X_GENB_ACTCMPAU_ONE  0x00000030 // Drive pwmB High
#define PWM_X_GENB_ACTLOAD_M     0x0000000C // Action for Counter=LOAD
#define PWM_X_GENB_ACTLOAD_NONE  0x00000000 // Do nothing
#define PWM_X_GENB_ACTLOAD_INV   0x00000004 // Invert pwmB
#define PWM_X_GENB_ACTLOAD_ZERO  0x00000008 // Drive pwmB Low
#define PWM_X_GENB_ACTLOAD_ONE   0x0000000C // Drive pwmB High
#define PWM_X_GENB_ACTZERO_M     0x00000003 // Action for Counter=0
#define PWM_X_GENB_ACTZERO_NONE  0x00000000 // Do nothing
#define PWM_X_GENB_ACTZERO_INV   0x00000001 // Invert pwmB
#define PWM_X_GENB_ACTZERO_ZERO  0x00000002 // Drive pwmB Low
#define PWM_X_GENB_ACTZERO_ONE   0x00000003 // Drive pwmB High

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_DBCTL register.
//
//*****************************************************************************
#define PWM_X_DBCTL_ENABLE 0x00000001 // Dead-Band Generator Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_DBRISE register.
//
//*****************************************************************************
#define PWM_X_DBRISE_DELAY_M 0x00000FFF // Dead-Band Rise Delay
#define PWM_X_DBRISE_DELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_DBFALL register.
//
//*****************************************************************************
#define PWM_X_DBFALL_DELAY_M 0x00000FFF // Dead-Band Fall Delay
#define PWM_X_DBFALL_DELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_FLTSRC0
// register.
//
//*****************************************************************************
#define PWM_X_FLTSRC0_FAULT3 0x00000008 // Fault3 Input
#define PWM_X_FLTSRC0_FAULT2 0x00000004 // Fault2 Input
#define PWM_X_FLTSRC0_FAULT1 0x00000002 // Fault1 Input
#define PWM_X_FLTSRC0_FAULT0 0x00000001 // Fault0 Input

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_FLTSRC1
// register.
//
//*****************************************************************************
#define PWM_X_FLTSRC1_DCMP7 0x00000080 // Digital Comparator 7
#define PWM_X_FLTSRC1_DCMP6 0x00000040 // Digital Comparator 6
#define PWM_X_FLTSRC1_DCMP5 0x00000020 // Digital Comparator 5
#define PWM_X_FLTSRC1_DCMP4 0x00000010 // Digital Comparator 4
#define PWM_X_FLTSRC1_DCMP3 0x00000008 // Digital Comparator 3
#define PWM_X_FLTSRC1_DCMP2 0x00000004 // Digital Comparator 2
#define PWM_X_FLTSRC1_DCMP1 0x00000002 // Digital Comparator 1
#define PWM_X_FLTSRC1_DCMP0 0x00000001 // Digital Comparator 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_MINFLTPER
// register.
//
//*****************************************************************************
#define PWM_X_MINFLTPER_M 0x0000FFFF // Minimum Fault Period
#define PWM_X_MINFLTPER_S 0

//*****************************************************************************
//
// The following are defines for the PWM Generator extended offsets.
//
//*****************************************************************************
#define PWM_O_X_FLTSEN   0x00000000 // Fault logic sense
#define PWM_O_X_FLTSTAT0 0x00000004 // Pin and comparator status
#define PWM_O_X_FLTSTAT1 0x00000008 // Digital comparator status
#define PWM_EXT_0_OFFSET 0x00000800 // PWM0 extended base
#define PWM_EXT_1_OFFSET 0x00000880 // PWM1 extended base
#define PWM_EXT_2_OFFSET 0x00000900 // PWM2 extended base
#define PWM_EXT_3_OFFSET 0x00000980 // PWM3 extended base

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_FLTSEN register.
//
//*****************************************************************************
#define PWM_X_FLTSEN_FAULT3 0x00000008 // Fault3 Sense
#define PWM_X_FLTSEN_FAULT2 0x00000004 // Fault2 Sense
#define PWM_X_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_X_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_X_FLTSTAT0_FAULT3 0x00000008 // Fault Input 3
#define PWM_X_FLTSTAT0_FAULT2 0x00000004 // Fault Input 2
#define PWM_X_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_X_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_X_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_X_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_X_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_X_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_X_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_X_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_X_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_X_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_X_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

#endif                                  // __HW_PWM_H__
